iPig/src/InformationRegisters/КарточкаВнесенияДанных/КарточкаВнесенияДанных.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>КарточкаВнесенияДанных</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>МассаВвод</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>МассаВыбытие</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ДатаВыбытие</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодВыбытие</name>
    <type>
      <types>CatalogRef.Причины</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипВыбытие</name>
    <type>
      <types>EnumRef.ТипВыбытие</types>
    </type>
  </attributes>
  <dimensions>
    <name>НомерЖивотного</name>
    <type>
      <types>CatalogRef.НомерЖивотного</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаРождения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Пол</name>
    <type>
      <types>EnumRef.Пол</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипЖивотного</name>
    <type>
      <types>EnumRef.ТипЖивотного</types>
    </type>
  </dimensions>
  <dimensions>
    <name>КодПороды</name>
    <type>
      <types>CatalogRef.Порода</types>
    </type>
  </dimensions>
  <dimensions>
    <name>IDНомер</name>
    <type>
      <types>CatalogRef.IDНомер</types>
    </type>
  </dimensions>
  <dimensions>
    <name>УшнойВыщип</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>НомерГнезда</name>
    <type>
      <types>CatalogRef.НомерГнезда</types>
    </type>
  </dimensions>
  <dimensions>
    <name>РодителиОтец</name>
    <type>
      <types>CatalogRef.КарточкаРодители</types>
      <types>CatalogRef.НомерЖивотного</types>
    </type>
  </dimensions>
  <dimensions>
    <name>РодителиМать</name>
    <type>
      <types>CatalogRef.КарточкаРодители</types>
      <types>CatalogRef.НомерЖивотного</types>
    </type>
  </dimensions>
  <dimensions>
    <name>DGTagId</name>
    <type>
      <types>CatalogRef.IDНомер</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

iPig/src/InformationRegisters/КарточкаХряка/КарточкаХряка.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>КарточкаХряка</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>МассаВыбытие</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>НомерЖивотного</name>
    <type>
      <types>CatalogRef.НомерЖивотного</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаРождения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>КодПороды</name>
    <type>
      <types>CatalogRef.Порода</types>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>НазваниеПороды</name>
    <type>
      <types>CatalogRef.Порода</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаВыбытие</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>КодПричины</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ПричинаВыбытия</name>
    <type>
      <types>CatalogRef.Причины</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НомерЖивотногоОтец</name>
    <type>
      <types>CatalogRef.НомерЖивотного</types>
    </type>
  </dimensions>
  <dimensions>
    <name>КодПородыОтец</name>
    <type>
      <types>CatalogRef.Порода</types>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>НомерЖивотногоМать</name>
    <type>
      <types>CatalogRef.НомерЖивотного</types>
    </type>
  </dimensions>
  <dimensions>
    <name>КодПородыМать</name>
    <type>
      <types>CatalogRef.Порода</types>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Статус</name>
    <type>
      <types>EnumRef.Статус</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаСлучка</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>НомерЖивотногоСвиноматка</name>
    <type>
      <types>CatalogRef.НомерЖивотного</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаРожденияСвиноматка</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>КодПородыСвиноматка</name>
    <type>
      <types>CatalogRef.Порода</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаВыбытиеСвиноматка</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ПричинаВыбытияСвиноматка</name>
    <type>
      <types>CatalogRef.Причины</types>
    </type>
  </dimensions>
  <dimensions>
    <name>КодРаботника</name>
    <type>
      <types>CatalogRef.Работник</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НомерОпоросаСвиноматка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>КодПородыОпорос</name>
    <type>
      <types>CatalogRef.Порода</types>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>НазваниеПородыОпорос</name>
    <type>
      <types>CatalogRef.Порода</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипВыбытие</name>
    <type>
      <types>EnumRef.ТипВыбытие</types>
    </type>
  </dimensions>
  <dimensions>
    <name>DGTagId</name>
    <type>
      <types>CatalogRef.IDНомер</types>
    </type>
  </dimensions>
  <dimensions>
    <name>DanAvlTagID</name>
    <type>
      <types>CatalogRef.IDНомер</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

iPig/src/Enums/Пол/Пол.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>Пол</name>
  <enumValues>
    <name>Хряк</name>
  </enumValues>
  <enumValues>
    <name>Свинка</name>
  </enumValues>
</mdclass:Enum>

iPig/src/InformationRegisters/КарточкаВнесенияДанных/RecordSetModule.bsl
Процедура ПередЗаписью(Отказ, Замещение)
	Для Каждого Запись Из ЭтотОбъект Цикл
		Если Запись.Пол = Перечисления.Пол.Хряк Тогда
			НаборЗаписей1 = РегистрыСведений.КарточкаХряка.СоздатьНаборЗаписей();
			НаборЗаписей1.Отбор.НомерЖивотного.Установить(Запись.НомерЖивотного);
			НаборЗаписей1.Отбор.Период.Установить(Запись.Период);
			НаборЗаписей1.Прочитать();
			Если НаборЗаписей1.Количество() = 0 Тогда
				НоваяСтрока1 = РегистрыСведений.КарточкаХряка.СоздатьМенеджерЗаписи();
				НоваяСтрока1.Период 			= Запись.Период;
				НоваяСтрока1.НомерЖивотного 	= Запись.НомерЖивотного;
				НоваяСтрока1.ДатаРождения 		= Запись.ДатаРождения;
				НоваяСтрока1.КодПороды 			= Запись.КодПороды;
				НоваяСтрока1.ДатаВыбытие 		= Запись.ДатаВыбытие;
				//НоваяСтрока1.МассаВыбытие = Запись.МассаВыбытие;
				НоваяСтрока1.НомерЖивотногоОтец = Запись.РодителиОтец;
				НоваяСтрока1.НомерЖивотногоМать = Запись.РодителиМать;
				НоваяСтрока1.DGTagId			= Запись.DGTagId;
				НоваяСтрока1.Записать();
				//НоваяСтрока2 = Документы.КарточкаХрякаДок.СоздатьДокумент();
				//НоваяСтрока2.Дата = ТекущаяДата();
				//НоваяСтрока2.НомерЖивотного = Запись.НомерЖивотного;
				//НоваяСтрока2.ДатаРождения = Запись.ДатаРождения;
				//НоваяСтрока2.КодПороды = Запись.КодПороды;
				//НоваяСтрока2.НазваниеПороды = Запись.НазваниеПороды;
				//НоваяСтрока2.ДатаВыбытие = Запись.ДатаВыбытие;
				//НоваяСтрока2.МассаВыбытие = Запись.МассаВыбытие;
				//НоваяСтрока2.НомерЖивотногоОтец = Запись.НомерЖивотногоОтец;
				//НоваяСтрока2.НомерЖивотногоМать = Запись.НомерЖивотногоМать;
				//НоваяСтрока2.Записать();
			Иначе
				Для Каждого СтрНаборЗаписей Из НаборЗаписей1 Цикл
					СтрНаборЗаписей.Период 			= Запись.Период;
					СтрНаборЗаписей.НомерЖивотного 	= Запись.НомерЖивотного;
					СтрНаборЗаписей.ДатаРождения 	= Запись.ДатаРождения;
					СтрНаборЗаписей.КодПороды 		= Запись.КодПороды;
					//СтрНаборЗаписей.НазваниеПороды = Запись.НазваниеПороды;
					//СтрНаборЗаписей.ДатаВыбытие = Запись.ДатаВыбытие;
					//СтрНаборЗаписей.МассаВыбытие = Запись.МассаВыбытие;
					СтрНаборЗаписей.НомерЖивотногоОтец 	= Запись.РодителиОтец;
					СтрНаборЗаписей.НомерЖивотногоМать 	= Запись.РодителиМать;
					СтрНаборЗаписей.DGTagId				= Запись.DGTagId;
					//СтрНаборЗаписей.МассаВвод = Запись.МассаВвод;
				КонецЦикла;
				НаборЗаписей1.Записать();
			КонецЕсли;
		Иначе
			НаборЗаписей = РегистрыСведений.КарточкаСвиноматки.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.НомерЖивотного.Установить(Запись.НомерЖивотного);
			НаборЗаписей.Отбор.Период.Установить(Запись.Период);
			НаборЗаписей.Прочитать();
			Если НаборЗаписей.Количество() = 0 Тогда
				НоваяСтрока = РегистрыСведений.КарточкаСвиноматки.СоздатьМенеджерЗаписи();
				НоваяСтрока.Период 				= Запись.Период;
				НоваяСтрока.НомерЖивотного 		= Запись.НомерЖивотного;
				НоваяСтрока.ДатаРождения 		= Запись.ДатаРождения;
				НоваяСтрока.КодПороды 			= Запись.КодПороды;
				НоваяСтрока.IDНомер 			= Запись.IDНомер;
				НоваяСтрока.УшнойВыщип 			= Запись.УшнойВыщип;
				НоваяСтрока.МассаВвод 			= Запись.МассаВвод;
				НоваяСтрока.НомерЖивотногоОтец 	= Запись.РодителиОтец;
				НоваяСтрока.НомерЖивотногоМать 	= Запись.РодителиМать;
				НоваяСтрока.ДатаВыбытие         = Запись.ДатаВыбытие;
				НоваяСтрока.ПричинаВыбытия      = Запись.КодВыбытие;
				НоваяСтрока.ТипВыбытие			= Запись.ТипВыбытие;
				НоваяСтрока.МассаВыбытие		= Запись.МассаВыбытие;
				НоваяСтрока.DGTagId				= Запись.DGTagId;
				НоваяСтрока.Записать();
			Иначе
				Если Запись.ДатаВыбытие = '00010101000000' Тогда
					Для Каждого СтрНаборЗаписей Из НаборЗаписей Цикл
						СтрНаборЗаписей.Период 				= Запись.Период;
						СтрНаборЗаписей.НомерЖивотного 		= Запись.НомерЖивотного;
						СтрНаборЗаписей.ДатаРождения 		= Запись.ДатаРождения;
						СтрНаборЗаписей.КодПороды 			= Запись.КодПороды;
						СтрНаборЗаписей.IDНомер 			= Запись.IDНомер;
						СтрНаборЗаписей.УшнойВыщип 			= Запись.УшнойВыщип;
						СтрНаборЗаписей.МассаВвод 			= Запись.МассаВвод;
						СтрНаборЗаписей.НомерЖивотногоОтец 	= Запись.РодителиОтец;
						СтрНаборЗаписей.НомерЖивотногоМать 	= Запись.РодителиМать;
						СтрНаборЗаписей.DGTagId				= Запись.DGTagId;

					КонецЦикла;
					НаборЗаписей.Записать(Истина);
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры
